UB_Copy/src/Catalogs/ШтатноеРасписание/ШтатноеРасписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтатноеРасписание</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПланирования</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>Утверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПозицийПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

UB_Copy/src/Catalogs/УБ_ШтатноеРасписание/УБ_ШтатноеРасписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБ_ШтатноеРасписание</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>DefinedType.УБ_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПозицийПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьМодельПланирования</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </attributes>
</mdclass:Catalog>

UB_Copy/src/CommonModules/УБ_ОбщегоНазначенияКлиент/Module.bsl
Функция ЗначениеРеквизитаПоУмолчанию(ИмяРеквизита = "") Экспорт
	
	ЗначениеПоУмолчанию = Неопределено;
	
	Если УБ_ОбщегоНазначенияПовтИсп.ИспользоватьСправочникиКАУП() Тогда
		
		Если ИмяРеквизита = "Должность" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.Должности.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "Подразделение" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "ПоказательРасчетаЗарплаты" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.ПоказателиРасчетаЗарплаты.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "Сотрудник" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "ШтатноеРасписание" Или ИмяРеквизита = "ДолжностьПоШтатномуРасписанию" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.ШтатноеРасписание.ПустаяСсылка");
		КонецЕсли;
		
	Иначе
		
		Если ИмяРеквизита = "Должность" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_Должности.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "Подразделение" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_Подразделения.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "ПоказательРасчетаЗарплаты" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_ПоказателиРасчетаЗарплаты.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "Сотрудник" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_Сотрудники.ПустаяСсылка");
		ИначеЕсли ИмяРеквизита = "ШтатноеРасписание" Или ИмяРеквизита = "ДолжностьПоШтатномуРасписанию" Тогда
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_ШтатноеРасписание.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;      
	
	Если ИмяРеквизита = "Компания" Тогда
		ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.УБ_Компании.Компания");
	КонецЕсли;
	
	Если УБ_ОбщегоНазначенияПовтИсп.ЭтоРозница() Тогда
		ЗначениеПоУмолчанию = Неопределено;
	Иначе
		Если ИмяРеквизита = "Проект" Тогда		//проекты предполагаются во всех конфигурациях
			ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
		КонецЕсли; 		
	КонецЕсли;
	
	Если ИмяРеквизита = "Организация" Тогда
		ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	КонецЕсли;
	
	Возврат  ЗначениеПоУмолчанию;
	
КонецФункции
